---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SpacingLengthU
source: html/b5c31e23-cac9-ef10-e7b2-4355cda6f5f4.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SpacingLengthU Property

"Distance"

## Syntax (C#)
```csharp
public static ForgeTypeId SpacingLengthU { get; }
```